import { AppProps } from "../../../state/state";
import React from 'react';
import './styles.css'

const Cookie: React.FC = () => {
    return (

        <div className="styles_container__ImQx_ styles_ConditionsContainer__1iXcg styles_medium__Y53XA">
            <div className="styles_ConditionsContainerContent__Z6XSp">
                <div className="style_EditorTemplateAbout__ag7nW styles_ConditionsMargin__egnni">
                    <div className="style_EditorTemplateAboutContent__QRU_U">
                        <h2><strong>Як ми використовуємо Cookie</strong></h2>
                        <p>
                            <strong>Cookie</strong> — це невеликий текстовий файл, який сайт зберігає на вашому комп'ютері або мобільному пристрої,
                            коли ви відвідуєте сайт. Браузери підтримують файли cookie та аналогічні технології (як-от локальне зберігання та пікселі),
                            щоб сайти, подібні до нашого, могли запам'ятовувати інформацію про ваше відвідування та використовувати її для поліпшення
                            вашого досвіду і створення сукупної анонімної статистики про використання сайту. У цій умові ми використовуємо термін
                            <strong> 'кукі'</strong> для позначення як кукі, так і аналогічних технологій.
                        </p>

                        <p>
                            Cookies можуть бути встановлені сайтом, який ви відвідуєте (так звані <strong>'cookies першої сторони'</strong>), або іншою
                            стороною, наприклад, тими, хто надає аналітичні або рекламні послуги або інтерактивний контент на сайті
                            (<strong>'cookies третьої сторони'</strong>).
                        </p>

                        <p>
                            Наші основні файли cookie включають строго необхідні файли cookie, функціональні файли cookie,
                            аналітичні файли cookie та рекламні файли cookie.
                        </p>

                        <p>
                            <strong>Необхідні файли Cookie</strong>: Ці файли cookie необхідні для функціонування сайту і не можуть бути
                            відключені в наших системах. Ви можете налаштувати свій браузер на блокування або попередження про ці файли cookie,
                            але це призведе до того, що деякі частини сайту не працюватимуть. До них належать:
                        </p>

                        <table>
                            <thead>
                                <tr>
                                    <th><strong>ІМ'Я</strong></th>
                                    <th><strong>ОПИС</strong></th>
                                    <th><strong>EXPIRES</strong></th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td><strong>lang</strong></td>
                                    <td>Цей файл cookie запам'ятовує яка у користувача поточна мова</td>
                                    <td>30 днів</td>
                                </tr>
                                <tr>
                                    <td><strong>mguid</strong></td>
                                    <td>Цей файл cookie призначений для визначення сесії клієнта</td>
                                    <td>20 днів</td>
                                </tr>
                                <tr>
                                    <td><strong>language</strong></td>
                                    <td>Цей файл cookie запам'ятовує яка у користувача поточна мова</td>
                                    <td>1 рік</td>
                                </tr>
                                <tr>
                                    <td><strong>autoLang</strong></td>
                                    <td>Цей файл cookie призначений для того, щоб визначати, чи є поточна мова оригіналом</td>
                                    <td>1 рік</td>
                                </tr>
                                <tr>
                                    <td><strong>cookieSettings</strong></td>
                                    <td>Цей файл cookie призначений для того, щоб ми запам'ятовували вибір користувача які куки залишати</td>
                                    <td>1 рік</td>
                                </tr>
                            </tbody>
                        </table>

                        <h3><strong>Google Maps</strong></h3><p>Google Maps API - це картографічна служба, яку надає компанія Google Inc., 1600 Amphitheater Parkway, Mountain View, CA 94043, США. Нам потрібно використовувати Google Maps API, щоб ви могли вказати місце доставки вашого замовлення на карті. При використанні Google Maps інформація про використання вами цього веб-сайту (включаючи ваш IP-адресу) може передаватися на сервер Google в США та зберігатися там. Нижче подані посилання надають інформацію про <a href="https://policies.google.com/privacy" target="_blank">захист даних</a> та <a href="https://www.google.com/help/terms_maps/">Умови використання</a> Google Maps.</p>

                        <h3><strong>Як я можу контролювати файли cookie і як використовуються мої дані?</strong></h3><p>Існує кілька способів, за допомогою яких ви можете контролювати, яка інформація збирається файлами cookie на нашому сайті і як ця інформація використовується.</p>

                        <h3><strong>Налаштування вашого браузера</strong></h3><p>У вашому браузері є елементи керування, які дають змогу вам керувати використанням файлів cookie на відвідуваних вами сайтах. Більшість браузерів мають функції, що дають змогу переглядати та видаляти файли cookie, що зберігаються на вашому пристрої, а також блокувати файли cookie на всіх або обраних сайтах. Для отримання додаткової інформації тут наведено посилання на зовнішні довідкові матеріали для деяких популярних браузерів:</p><ul><li><p>Mozilla Firefox</p></li><li><p>Apple Safari</p></li><li><p>Google Chrome</p></li><li><p>Microsoft Edge</p></li></ul>

                        <h3><strong>Налаштування вашого мобільного пристрою</strong></h3><p>Ваш мобільний пристрій також може мати налаштування браузера, що дають змогу контролювати використання файлів cookie, особливо якщо пристрій підтримує встановлення додатків, як, наприклад, пристрої iOS і Android. Пристрої OS і Android також включають додаткові налаштування пристрою, які контролюють, чи можуть рекламні партнери використовувати інформацію про вашу активність у додатку в рекламних цілях. На пристроях iOS ви можете знайти налаштування під назвою 'Обмежити відстеження реклами'. На пристроях Android ви можете знайти налаштування під назвою 'Відмовитися від персоналізації реклами'.</p>

                        <h3><strong>Керування файлами cookie</strong></h3><p>Також можна повністю заборонити прийняття браузером файлів cookie, змінивши налаштування файлів cookie в браузері. Зазвичай ці налаштування можна знайти в меню 'Параметри' або 'Налаштування' вашого браузера. Зверніть увагу, що видалення наших файлів cookie або вимкнення майбутніх файлів cookie або технологій відстеження може позбавити вас доступу до певних розділів або функцій наших Послуг або іншим чином негативно позначитися на вашому досвіді.</p><p>Ми можемо оновлювати цю Політику використання файлів cookie. Ми рекомендуємо вам періодично переглядати цю сторінку для отримання останньої інформації про файли cookie.</p>

                        <h3><strong>Ваш поточний вибір</strong></h3><p>Ви можете змінити налаштування файлів cookie, натиснувши на цю кнопку:</p>
                    </div>
                </div><button className="styles_button___Dvql styles_appearanceStroke__LKd1h">
                    <div className="styles_buttonIconLeft__EqV3D"><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M5 3L3 5L4.40625 7.10938C4.77725 7.66638 5.40231 8 6.07031 8H6.58594L10.123 11.5371L4.48828 17.1699C3.83628 17.8219 3.83628 18.8792 4.48828 19.5312L5.4668 20.5098C5.7938 20.8368 6.22044 21 6.64844 21C7.07544 21 7.50408 20.8377 7.83008 20.5117L12.5 15.8398L17.1699 20.5117C17.4959 20.8377 17.9246 21 18.3516 21C18.7786 21 19.2052 20.8377 19.5312 20.5117L20.5098 19.5332C21.1618 18.8812 21.1618 17.8239 20.5098 17.1719L15.8398 12.5L17.4004 10.9395C17.5974 10.9685 17.795 11 18 11C20.209 11 22 9.209 22 7C22 6.414 21.8676 5.86037 21.6406 5.35938L20.2266 6.77344L18.6719 6.32812L18.2266 4.77344L19.6406 3.35938C19.1396 3.13238 18.586 3 18 3C15.791 3 14 4.791 14 7C14 7.205 14.0315 7.40261 14.0605 7.59961L11.5371 10.123L8 6.58594V6.07031C8 5.40231 7.66638 4.77725 7.10938 4.40625L5 3ZM16.6934 4.86914L16.7832 5.1875L17.2285 6.74219L17.457 7.54297L18.2578 7.77148L19.8125 8.2168L20.1309 8.30859C19.6899 9.02259 18.9 9.5 18 9.5C17.913 9.5 17.78 9.48003 17.625 9.45703L16.877 9.34375L16.3398 9.87891L14.7793 11.4395L14.7695 11.4297L11.4297 14.7695L11.4395 14.7793L6.76953 19.4492C6.73653 19.4822 6.69444 19.5 6.64844 19.5C6.60244 19.5 6.5623 19.4822 6.5293 19.4492L5.55078 18.4727C5.48478 18.4067 5.48478 18.2975 5.55078 18.2305L15.1211 8.66016L15.6543 8.10938L15.541 7.35938C15.52 7.21938 15.5 7.087 15.5 7C15.5 6.1 15.9784 5.30914 16.6934 4.86914ZM14.7793 13.5605L19.4512 18.2305C19.5172 18.2965 19.5172 18.4037 19.4512 18.4707L18.4727 19.4492C18.4397 19.4822 18.3995 19.498 18.3535 19.498C18.3065 19.498 18.2654 19.4822 18.2324 19.4492L13.5625 14.7793L14.7793 13.5605Z" fill="currentColor"></path></svg>
                    </div>Керування cookies</button>
            </div>
        </div>

    )
}

export default Cookie;