import { FC } from 'react';
import './../../styles/sidebar.css'; // стиль можна адаптувати під себе
import { useAuth } from '../../context/AuthContext';

type SidebarProps = {
    onClose: () => void;
};

const Sidebar: FC<SidebarProps> = ({ onClose }) => {

    const { state: authState } = useAuth();
    const userID = authState.user?.id;
    const userName = authState.user?.name;
    const userRole = authState.user?.role;

    return (

        <div className="styles_sideBarMenu__EQSTn">
            <div className="styles_background__l_QIG" data-projection-id="4" style={{ opacity: 1 }}>
            </div>
            <div className="styles_menu__iIAhW" data-projection-id="5" style={{ transform: 'translateX(0%) translateZ(0px)' }}>
                <div className="styles_sideBarMenuContent__zKNDC">
                    <ul className="styles_padded__fV_PM" data-projection-id="6" style={{ opacity: 1, position: 'relative', transform: 'none' }}>
                        {userID == null && (
                            <div className="styles_authBlock__23mDB"><a href="/login"><button className="styles_button___Dvql styles_sizeLarge__YGfzR styles_appearanceStroke__LKd1h styles_withShadow__qhvq4 styles_fillContent__OccwK styles_fullWidth__x3ayC styles_personalAccountButton__K_crG">
                                <div className="styles_inner__td4kS">
                                    <div className="styles_iconHolder__lj_wy">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M12 2C6.477 2 2 6.477 2 12C2 17.523 6.477 22 12 22C17.523 22 22 17.523 22 12C22 6.477 17.523 2 12 2ZM12 4C16.418 4 20 7.582 20 12C20 13.5973 19.5254 15.0811 18.7188 16.3301L17.9492 15.7344C16.3972 14.5374 13.537 14 12 14C10.463 14 7.60178 14.5374 6.05078 15.7344L5.28125 16.332C4.47404 15.0828 4 13.5979 4 12C4 7.582 7.582 4 12 4ZM12 5.75C10.208 5.75 8.75 7.208 8.75 9C8.75 10.792 10.208 12.25 12 12.25C13.792 12.25 15.25 10.792 15.25 9C15.25 7.208 13.792 5.75 12 5.75ZM12 7.75C12.689 7.75 13.25 8.311 13.25 9C13.25 9.689 12.689 10.25 12 10.25C11.311 10.25 10.75 9.689 10.75 9C10.75 8.311 11.311 7.75 12 7.75ZM12 16C15.1007 16 16.7681 17.1685 17.5488 17.7539C16.11 19.1418 14.1569 20 12 20C9.84315 20 7.89002 19.1418 6.45117 17.7539C7.2319 17.1685 8.89929 16 12 16ZM6.05469 17.3398C6.17566 17.4731 6.29727 17.6059 6.42578 17.7305C6.29711 17.6053 6.17473 17.4734 6.05469 17.3398ZM17.9121 17.375C17.8024 17.4955 17.6929 17.6168 17.5762 17.7305C17.6926 17.6175 17.8015 17.495 17.9121 17.375Z" fill="currentColor">
                                            </path>
                                        </svg>
                                    </div>Авторизуйтесь
                                    <div className="styles_rightIcon__d4zzs">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                            </path>
                                        </svg>
                                    </div>
                                </div>
                            </button></a>
                                <div className="styles_personalAccountLogin__TaYTs"><b>Авторизуйтесь</b> щоб спростити процес замовлення та користуватися додатковими функціями.
                                </div>
                            </div>
                        )}
                        {userID != null && (
                            <div className="styles_authBlock__23mDB"><a href={userRole === 'admin' ? '/adminpanel' : undefined}><button className="styles_button___Dvql styles_sizeLarge__YGfzR styles_appearanceStroke__LKd1h styles_withShadow__qhvq4 styles_fillContent__OccwK styles_fullWidth__x3ayC styles_personalAccountButton__K_crG">
                                <div className="styles_inner__td4kS">
                                    <div className="styles_iconHolder__lj_wy">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M12 2C6.477 2 2 6.477 2 12C2 17.523 6.477 22 12 22C17.523 22 22 17.523 22 12C22 6.477 17.523 2 12 2ZM12 4C16.418 4 20 7.582 20 12C20 13.5973 19.5254 15.0811 18.7188 16.3301L17.9492 15.7344C16.3972 14.5374 13.537 14 12 14C10.463 14 7.60178 14.5374 6.05078 15.7344L5.28125 16.332C4.47404 15.0828 4 13.5979 4 12C4 7.582 7.582 4 12 4ZM12 5.75C10.208 5.75 8.75 7.208 8.75 9C8.75 10.792 10.208 12.25 12 12.25C13.792 12.25 15.25 10.792 15.25 9C15.25 7.208 13.792 5.75 12 5.75ZM12 7.75C12.689 7.75 13.25 8.311 13.25 9C13.25 9.689 12.689 10.25 12 10.25C11.311 10.25 10.75 9.689 10.75 9C10.75 8.311 11.311 7.75 12 7.75ZM12 16C15.1007 16 16.7681 17.1685 17.5488 17.7539C16.11 19.1418 14.1569 20 12 20C9.84315 20 7.89002 19.1418 6.45117 17.7539C7.2319 17.1685 8.89929 16 12 16ZM6.05469 17.3398C6.17566 17.4731 6.29727 17.6059 6.42578 17.7305C6.29711 17.6053 6.17473 17.4734 6.05469 17.3398ZM17.9121 17.375C17.8024 17.4955 17.6929 17.6168 17.5762 17.7305C17.6926 17.6175 17.8015 17.495 17.9121 17.375Z" fill="currentColor">
                                            </path>
                                        </svg>
                                    </div>{userName}
                                    <div className="styles_rightIcon__d4zzs">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                            </path>
                                        </svg>
                                    </div>
                                </div>

                            </button></a>
                            {userRole === 'admin' && (
                                <div className="styles_personalAccountLogin__TaYTs"><b>Адміністративний аккаунт</b> - дозволяє змінювати меню та галерею</div>
                            )}
                            </div>
                        )}
                        <div className="styles_heading__sEvKm">Контакти
                        </div><a target="_blank" href="https://maps.google.com/?q=Sobornyi Ave, 100А, Oleksandriia, Kirovohrads'ka oblast, Ukraine, 28000" className="styles_item__h2xmM" rel="noreferrer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12 1C8.686 1 6 3.686 6 7C6 11.286 12 18 12 18C12 18 18 11.286 18 7C18 3.686 15.314 1 12 1ZM12 4.85742C13.184 4.85742 14.1426 5.816 14.1426 7C14.1426 8.183 13.183 9.14258 12 9.14258C10.817 9.14258 9.85742 8.184 9.85742 7C9.85742 5.816 10.816 4.85742 12 4.85742ZM4.80078 15L2 22H22L19.1992 15H16.8125C16.3275 15.731 15.8406 16.408 15.3926 17H17.8477L19.0469 20H4.95312L6.15234 17H8.60742C8.15942 16.408 7.6725 15.731 7.1875 15H4.80078Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">Sobornyi Ave, 100А, Oleksandriia, Kirovohrads'ka oblast, Ukraine, 28000
                            </div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M5 3C3.90694 3 3 3.90694 3 5V19C3 20.0931 3.90694 21 5 21H19C20.0931 21 21 20.0931 21 19V12H19V19H5V5H12V3H5ZM14 3V5H17.5859L8.29297 14.293L9.70703 15.707L19 6.41406V10H21V3H14Z" fill="currentColor">
                                </path>
                            </svg></a><a href="tel:0661569641" className="styles_item__h2xmM" rel="noreferrer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M4 3C3.562 3 3 3.328 3 4C3 8.539 4.8408 12.8732 7.9668 16.0332C11.1268 19.1592 15.461 21 20 21C20.672 21 21 20.438 21 20V16.4902C21 15.9452 20.5684 15.5013 20.0234 15.4883C19.3934 15.4733 18.6006 15.4357 18.0996 15.3477C17.5576 15.2517 16.9043 15.0668 16.4453 14.9238C16.0853 14.8118 15.6947 14.9098 15.4277 15.1758L13.2109 17.3809C11.6789 16.5739 10.4511 15.6329 9.41211 14.5879C8.36711 13.5489 7.42614 12.3211 6.61914 10.7891L8.82422 8.57227C9.09022 8.30527 9.18817 7.91273 9.07617 7.55273C8.93417 7.09473 8.74734 6.44239 8.65234 5.90039C8.56334 5.39939 8.52772 4.60656 8.51172 3.97656C8.49872 3.43156 8.05477 3 7.50977 3H4ZM12 3V5C15.866 5 19 8.134 19 12H21C21 7.029 16.971 3 12 3ZM12 7V9C13.657 9 15 10.343 15 12H17C17 9.239 14.761 7 12 7Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">0661569641
                            </div></a><a href="mailto:velikavika89@gmail.com" className="styles_item__h2xmM">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12 2C6.48867 2 2 6.48867 2 12C2 17.5113 6.48867 22 12 22H17V20H12C7.56933 20 4 16.4307 4 12C4 7.56933 7.56933 4 12 4C16.4307 4 20 7.56933 20 12V13.5C20 14.3408 19.3408 15 18.5 15C17.6592 15 17 14.3408 17 13.5V12C17 9.25042 14.7496 7 12 7C9.25042 7 7 9.25042 7 12C7 14.7496 9.25042 17 12 17C13.4136 17 14.6879 16.3989 15.5996 15.4473C16.2307 16.3809 17.2977 17 18.5 17C20.4212 17 22 15.4212 22 13.5V12C22 6.48867 17.5113 2 12 2ZM12 9C13.6687 9 15 10.3313 15 12C15 13.6687 13.6687 15 12 15C10.3313 15 9 13.6687 9 12C9 10.3313 10.3313 9 12 9Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">velikavika89@gmail.com
                            </div></a>
                        <div className="styles_heading__sEvKm">Ми в соцмережах
                        </div><a id="instagram" target="_blank" href="https://www.instagram.com/jumanji.alex?igsh=MWQzZnFudXB5Z2docQ==" className="styles_item__h2xmM" rel="noreferrer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M8 3C5.243 3 3 5.243 3 8V16C3 18.757 5.243 21 8 21H16C18.757 21 21 18.757 21 16V8C21 5.243 18.757 3 16 3H8ZM8 5H16C17.654 5 19 6.346 19 8V16C19 17.654 17.654 19 16 19H8C6.346 19 5 17.654 5 16V8C5 6.346 6.346 5 8 5ZM17 6C16.7348 6 16.4804 6.10536 16.2929 6.29289C16.1054 6.48043 16 6.73478 16 7C16 7.26522 16.1054 7.51957 16.2929 7.70711C16.4804 7.89464 16.7348 8 17 8C17.2652 8 17.5196 7.89464 17.7071 7.70711C17.8946 7.51957 18 7.26522 18 7C18 6.73478 17.8946 6.48043 17.7071 6.29289C17.5196 6.10536 17.2652 6 17 6ZM12 7C9.243 7 7 9.243 7 12C7 14.757 9.243 17 12 17C14.757 17 17 14.757 17 12C17 9.243 14.757 7 12 7ZM12 9C13.654 9 15 10.346 15 12C15 13.654 13.654 15 12 15C10.346 15 9 13.654 9 12C9 10.346 10.346 9 12 9Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">Instagram
                            </div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M5 3C3.90694 3 3 3.90694 3 5V19C3 20.0931 3.90694 21 5 21H19C20.0931 21 21 20.0931 21 19V12H19V19H5V5H12V3H5ZM14 3V5H17.5859L8.29297 14.293L9.70703 15.707L19 6.41406V10H21V3H14Z" fill="currentColor">
                                </path>
                            </svg></a><a id="google" target="_blank" href="https://www.google.com/maps/place/%D0%94%D0%B6%D1%83%D0%BC%D0%B0%D0%BD%D0%B4%D0%B6%D0%B8/@48.6630511,33.115388,588m/data=!3m1!1e3!4m15!1m8!3m7!1s0x40da7625eec7c05b:0x9546a6ce77f4eb2a!2sSobornyi+Ave,+100%D0%90,+Oleksandriia,+Kirovohrads'ka+oblast,+28000!3b1!8m2!3d48.6630511!4d33.1179629!16s%2Fg%2F11qg7j6xkc!3m5!1s0x40da772646ac5ba5:0x29ddc76a8f921cfe!8m2!3d48.6630511!4d33.1179629!16s%2Fg%2F11w91xntn9?entry=ttu&amp;g_ep=EgoyMDI1MDIxOS4xIKXMDSoJLDEwMjExNDU1SAFQAw%3D%3D" className="styles_item__h2xmM" rel="noreferrer">
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                                <path d="M21.915 10.752L21.697 9H17.304L20.278 6.026L18.73 4.615C16.88 2.929 14.49 2 12 2C6.486 2 2 6.486 2 12C2 17.514 6.486 22 12 22C17.514 22 22 17.514 22 12C22 11.61 21.973 11.214 21.915 10.752ZM12 20C7.582 20 4 16.418 4 12C4 7.582 7.582 4 12 4C14.076 4 15.96 4.797 17.382 6.093L15.248 8.227C14.372 7.473 13.247 7 12 7C9.239 7 7 9.239 7 12C7 14.761 9.239 17 12 17C14.049 17 15.806 15.764 16.578 14H13V11H19.931C19.972 11.328 20 11.661 20 12C20 16.418 16.418 20 12 20ZM11 9.171V11V14V14.829C9.836 14.416 9 13.304 9 12C9 10.696 9.836 9.584 11 9.171Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">Google
                            </div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M5 3C3.90694 3 3 3.90694 3 5V19C3 20.0931 3.90694 21 5 21H19C20.0931 21 21 20.0931 21 19V12H19V19H5V5H12V3H5ZM14 3V5H17.5859L8.29297 14.293L9.70703 15.707L19 6.41406V10H21V3H14Z" fill="currentColor">
                                </path>
                            </svg></a><a id="fb" target="_blank" href="https://www.facebook.com/people/%D0%92%D1%96%D0%BA%D1%82%D0%BE%D1%80%D1%96%D1%8F-%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B0/pfbid02HcmRjzXnuA6zwGNSH2U8AysnbgDRN9yaVuxxXdrWZPN2mvzdkpjjYeQHMPdznVPBl/?ref=ig_profile_ac" className="styles_item__h2xmM" rel="noreferrer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12 2C6.489 2 2 6.489 2 12C2 17.511 6.489 22 12 22C17.511 22 22 17.511 22 12C22 6.489 17.511 2 12 2ZM12 4C16.4301 4 20 7.56988 20 12C20 16.0145 17.0653 19.313 13.2188 19.8984V14.3848H15.5469L15.9121 12.0195H13.2188V10.7266C13.2188 9.74356 13.539 8.87109 14.459 8.87109H15.9355V6.80664C15.6755 6.77164 15.1268 6.69531 14.0898 6.69531C11.9238 6.69531 10.6543 7.83931 10.6543 10.4453V12.0195H8.42773V14.3848H10.6543V19.8789C6.87029 19.2408 4 15.9702 4 12C4 7.56988 7.56988 4 12 4Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">Facebook
                            </div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M5 3C3.90694 3 3 3.90694 3 5V19C3 20.0931 3.90694 21 5 21H19C20.0931 21 21 20.0931 21 19V12H19V19H5V5H12V3H5ZM14 3V5H17.5859L8.29297 14.293L9.70703 15.707L19 6.41406V10H21V3H14Z" fill="currentColor">
                                </path>
                            </svg></a>
                        <div className="styles_heading__sEvKm">Корисна інформація
                        </div>
                        <div className="styles_item__h2xmM">
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 16 16" fill="none">
                                <path d="M12.4804 1.99627C12.3724 1.99903 12.2681 2.03674 12.1832 2.10375C12.0984 2.17075 12.0376 2.26345 12.0098 2.36795C11.9821 2.47245 11.989 2.58312 12.0295 2.68337C12.07 2.78362 12.1418 2.86805 12.2343 2.92401C12.2343 2.92401 13 3.3676 13 4.50018C12.999 4.56644 13.0113 4.63222 13.036 4.6937C13.0607 4.75519 13.0974 4.81115 13.1439 4.85833C13.1904 4.90552 13.2458 4.94298 13.307 4.96856C13.3681 4.99413 13.4337 5.0073 13.5 5.0073C13.5662 5.0073 13.6318 4.99413 13.693 4.96856C13.7541 4.94298 13.8095 4.90552 13.856 4.85833C13.9026 4.81115 13.9392 4.75519 13.964 4.6937C13.9887 4.63222 14.0009 4.56644 14 4.50018C14 2.88276 12.7656 2.07635 12.7656 2.07635C12.6808 2.02148 12.5814 1.99356 12.4804 1.99627ZM4.49996 2.00018C4.49996 2.00018 3.89656 1.99329 3.27731 2.30292C2.65805 2.61254 1.99996 3.33351 1.99996 4.50018C1.99903 4.56644 2.01127 4.63222 2.03597 4.6937C2.06068 4.75519 2.09736 4.81115 2.14388 4.85833C2.1904 4.90552 2.24584 4.94298 2.30697 4.96856C2.3681 4.99413 2.4337 5.0073 2.49996 5.0073C2.56622 5.0073 2.63183 4.99413 2.69296 4.96856C2.75408 4.94298 2.80952 4.90552 2.85604 4.85833C2.90256 4.81115 2.93924 4.75519 2.96395 4.6937C2.98866 4.63222 3.0009 4.56644 2.99996 4.50018C2.99996 3.66685 3.34188 3.38782 3.72262 3.19745C4.10336 3.00707 4.49996 3.00018 4.49996 3.00018C4.56622 3.00112 4.632 2.98888 4.69348 2.96417C4.75497 2.93946 4.81093 2.90278 4.85811 2.85626C4.9053 2.80974 4.94277 2.7543 4.96834 2.69317C4.99391 2.63205 5.00708 2.56644 5.00708 2.50018C5.00708 2.43392 4.99391 2.36832 4.96834 2.30719C4.94277 2.24606 4.9053 2.19062 4.85811 2.1441C4.81093 2.09758 4.75497 2.0609 4.69348 2.03619C4.632 2.01148 4.56622 1.99924 4.49996 2.00018ZM7.99996 3.00018C7.04163 3.00018 6.07013 3.23326 5.3027 3.78143C4.53526 4.3296 3.99996 5.22935 3.99996 6.37518C3.99996 7.34542 4.30459 7.9748 4.5566 8.46307C4.80861 8.95134 4.99996 9.29024 4.99996 10.0002C4.99996 10.2767 4.94014 10.3747 4.82418 10.6291C4.70822 10.8835 4.5566 11.2683 4.5566 11.8185V11.8439L4.56051 11.8693C4.69928 13.2301 6.04298 14.1489 7.48824 13.9767C8.65585 13.8555 9.78926 13.2008 10.623 11.9846C11.434 10.8031 12 9.33056 12 7.00018C12 5.81769 11.6137 4.79747 10.9004 4.08807C10.187 3.37868 9.16819 3.00018 7.99996 3.00018ZM7.99996 4.00018C8.95674 4.00018 9.68792 4.29445 10.1933 4.79706C10.6987 5.29966 11 6.03067 11 7.00018C11 9.1758 10.5198 10.3676 9.79879 11.4181C9.10354 12.4324 8.25767 12.8947 7.38277 12.9846H7.37691L7.37301 12.9865C6.40696 13.1037 5.65223 12.5293 5.56441 11.7834C5.57049 11.428 5.63358 11.2662 5.73434 11.0451C5.83988 10.8135 5.99996 10.4736 5.99996 10.0002C5.99996 9.08512 5.69131 8.48652 5.44332 8.00604C5.19533 7.52556 4.99996 7.15494 4.99996 6.37518C4.99996 5.52101 5.33966 4.98326 5.88473 4.59393C6.42979 4.2046 7.20829 4.00018 7.99996 4.00018ZM7.99996 6.00018C7.73475 6.00018 7.48039 6.10554 7.29285 6.29307C7.10532 6.48061 6.99996 6.73496 6.99996 7.00018C6.99996 7.2654 7.10532 7.51975 7.29285 7.70729C7.48039 7.89482 7.73475 8.00018 7.99996 8.00018C8.26518 8.00018 8.51953 7.89482 8.70707 7.70729C8.8946 7.51975 8.99996 7.2654 8.99996 7.00018C8.99996 6.73496 8.8946 6.48061 8.70707 6.29307C8.51953 6.10554 8.26518 6.00018 7.99996 6.00018ZM2.49215 7.99237C2.42227 7.99329 2.35335 8.00885 2.28985 8.03805C2.22635 8.06725 2.16968 8.10943 2.12348 8.16188C2.07729 8.21433 2.04261 8.27588 2.02167 8.34256C2.00073 8.40924 1.994 8.47957 2.00192 8.54901C2.00192 8.54901 2.12005 9.48588 1.22262 10.0842C1.16686 10.1201 1.11881 10.1667 1.08126 10.2214C1.04371 10.2761 1.01742 10.3377 1.0039 10.4026C0.990385 10.4676 0.989922 10.5345 1.00254 10.5996C1.01516 10.6648 1.0406 10.7267 1.07739 10.7819C1.11418 10.8371 1.16158 10.8844 1.21684 10.9211C1.27209 10.9578 1.33409 10.9831 1.39923 10.9956C1.46436 11.0081 1.53134 11.0075 1.59624 10.9939C1.66115 10.9803 1.7227 10.9538 1.77731 10.9162C3.12988 10.0145 2.99801 8.45135 2.99801 8.45135C2.98761 8.32496 2.92958 8.20725 2.83566 8.12203C2.74174 8.03682 2.61895 7.99047 2.49215 7.99237ZM13.5 9.00018C13.3674 9.00018 13.2402 9.05286 13.1464 9.14663C13.0526 9.24039 13 9.36757 13 9.50018C13 9.63279 13.0526 9.75996 13.1464 9.85373C13.2402 9.9475 13.3674 10.0002 13.5 10.0002C13.6326 10.0002 13.7597 9.9475 13.8535 9.85373C13.9473 9.75996 14 9.63279 14 9.50018C14 9.36757 13.9473 9.24039 13.8535 9.14663C13.7597 9.05286 13.6326 9.00018 13.5 9.00018ZM7.49996 11.0002C7.36735 11.0002 7.24018 11.0529 7.14641 11.1466C7.05264 11.2404 6.99996 11.3676 6.99996 11.5002C6.99996 11.6328 7.05264 11.76 7.14641 11.8537C7.24018 11.9475 7.36735 12.0002 7.49996 12.0002C7.63257 12.0002 7.75975 11.9475 7.85351 11.8537C7.94728 11.76 7.99996 11.6328 7.99996 11.5002C7.99996 11.3676 7.94728 11.2404 7.85351 11.1466C7.75975 11.0529 7.63257 11.0002 7.49996 11.0002ZM13 12.0002C12.7347 12.0002 12.4804 12.1055 12.2929 12.2931C12.1053 12.4806 12 12.735 12 13.0002C12 13.2654 12.1053 13.5197 12.2929 13.7073C12.4804 13.8948 12.7347 14.0002 13 14.0002C13.2652 14.0002 13.5195 13.8948 13.7071 13.7073C13.8946 13.5197 14 13.2654 14 13.0002C14 12.735 13.8946 12.4806 13.7071 12.2931C13.5195 12.1055 13.2652 12.0002 13 12.0002ZM2.49996 13.0002C2.36735 13.0002 2.24018 13.0529 2.14641 13.1466C2.05264 13.2404 1.99996 13.3676 1.99996 13.5002C1.99996 13.6328 2.05264 13.76 2.14641 13.8537C2.24018 13.9475 2.36735 14.0002 2.49996 14.0002C2.63257 14.0002 2.75975 13.9475 2.85352 13.8537C2.94728 13.76 2.99996 13.6328 2.99996 13.5002C2.99996 13.3676 2.94728 13.2404 2.85352 13.1466C2.75975 13.0529 2.63257 13.0002 2.49996 13.0002Z" fill="currentColor">
                                </path>
                            </svg>
                            <div className="styles_itemText__IFZmX">Список алергенів
                            </div>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                </path>
                            </svg>
                        </div>
                        <div className="content-bottom"><a href="/aboutcompany">
                            <div className="styles_item__h2xmM">
                                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                                    <path d="M12 2C6.489 2 2 6.489 2 12C2 17.511 6.489 22 12 22C17.511 22 22 17.511 22 12C22 6.489 17.511 2 12 2ZM12 4C16.4301 4 20 7.56988 20 12C20 16.4301 16.4301 20 12 20C7.56988 20 4 16.4301 4 12C4 7.56988 7.56988 4 12 4ZM11 7V9H13V7H11ZM11 11V17H13V11H11Z" fill="currentColor">
                                    </path>
                                </svg>
                                <div className="styles_itemText__IFZmX">Інформація про компанію
                                </div>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                    </path>
                                </svg>
                            </div></a><a href="/cookiepolicy">
                                <div className="styles_item__h2xmM">
                                    <svg width="24" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M 6 2 C 4.9 2 4 2.9 4 4 L 4 20 C 4 21.1 4.9 22 6 22 L 14 22 C 13.67 21.41 13.410469 20.74 13.230469 20 L 6 20 L 6 4 L 13 4 L 13 9 L 18 9 L 18 11.480469 L 18.689453 11.169922 C 19.109453 10.979922 19.57 10.950312 20 11.070312 L 20 8 L 14 2 L 6 2 z M 8 12 L 8 14 L 13.269531 14 C 13.479531 13.64 13.799453 13.339922 14.189453 13.169922 L 16 12.369141 L 16 12 L 8 12 z M 19.5 13 L 15 15 L 15 18 C 15 21.915 18.22 23.743 19.5 24 C 20.78 23.743 24 21.915 24 18 L 24 15 L 19.5 13 z M 19.5 15.189453 L 22 16.300781 L 22 18 C 22 20.329 20.334 21.504531 19.5 21.894531 C 18.666 21.504531 17 20.329 17 18 L 17 16.300781 L 19.5 15.189453 z M 8 16 L 8 18 L 13 18 L 13 16 L 8 16 z" fill="currentColor">
                                        </path>
                                    </svg>
                                    <div className="styles_itemText__IFZmX">Політика використання файлів cookie
                                    </div>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                        </path>
                                    </svg>
                                </div></a><a href="/usingterms">
                                <div className="styles_item__h2xmM">
                                    <svg width="24" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M 6 2 C 4.9 2 4 2.9 4 4 L 4 20 C 4 21.1 4.9 22 6 22 L 14 22 C 13.67 21.41 13.410469 20.74 13.230469 20 L 6 20 L 6 4 L 13 4 L 13 9 L 18 9 L 18 11.480469 L 18.689453 11.169922 C 19.109453 10.979922 19.57 10.950312 20 11.070312 L 20 8 L 14 2 L 6 2 z M 8 12 L 8 14 L 13.269531 14 C 13.479531 13.64 13.799453 13.339922 14.189453 13.169922 L 16 12.369141 L 16 12 L 8 12 z M 19.5 13 L 15 15 L 15 18 C 15 21.915 18.22 23.743 19.5 24 C 20.78 23.743 24 21.915 24 18 L 24 15 L 19.5 13 z M 19.5 15.189453 L 22 16.300781 L 22 18 C 22 20.329 20.334 21.504531 19.5 21.894531 C 18.666 21.504531 17 20.329 17 18 L 17 16.300781 L 19.5 15.189453 z M 8 16 L 8 18 L 13 18 L 13 16 L 8 16 z" fill="currentColor">
                                        </path>
                                    </svg>
                                    <div className="styles_itemText__IFZmX">Умови користування
                                    </div>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                        </path>
                                    </svg>
                                </div></a><a href="/pivacypolicy">
                                <div className="styles_item__h2xmM">
                                    <svg width="24" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M 6 2 C 4.9 2 4 2.9 4 4 L 4 20 C 4 21.1 4.9 22 6 22 L 14 22 C 13.67 21.41 13.410469 20.74 13.230469 20 L 6 20 L 6 4 L 13 4 L 13 9 L 18 9 L 18 11.480469 L 18.689453 11.169922 C 19.109453 10.979922 19.57 10.950312 20 11.070312 L 20 8 L 14 2 L 6 2 z M 8 12 L 8 14 L 13.269531 14 C 13.479531 13.64 13.799453 13.339922 14.189453 13.169922 L 16 12.369141 L 16 12 L 8 12 z M 19.5 13 L 15 15 L 15 18 C 15 21.915 18.22 23.743 19.5 24 C 20.78 23.743 24 21.915 24 18 L 24 15 L 19.5 13 z M 19.5 15.189453 L 22 16.300781 L 22 18 C 22 20.329 20.334 21.504531 19.5 21.894531 C 18.666 21.504531 17 20.329 17 18 L 17 16.300781 L 19.5 15.189453 z M 8 16 L 8 18 L 13 18 L 13 16 L 8 16 z" fill="currentColor">
                                        </path>
                                    </svg>
                                    <div className="styles_itemText__IFZmX">Політика конфіденційності
                                    </div>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9 18L15 12L9 6" stroke="currentColor" strokeWidth="2">
                                        </path>
                                    </svg>
                                </div></a>
                        </div>
                    </ul>
                </div>
            </div>
            <div className="styles_closeButton__ra01P" data-projection-id="7" style={{ transform: 'translateY(0%) translateZ(0px)' }}>
                <button onClick={onClose} className="styles_button___Dvql styles_sizeSmall__NCTix styles_appearancePrimary__XMJoZ">
                    <svg width="24" height="24" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.7712 3.28686L8 7.0581L4.22876 3.28686L3.28595 4.22967L7.05719 8.00091L3.28595 11.7721L4.22876 12.715L8 8.94372L11.7712 12.715L12.714 11.7721L8.94281 8.00091L12.714 4.22967L11.7712 3.28686Z" fill="currentColor">
                        </path>
                    </svg>
                </button>
            </div>
        </div>



    );
};

export default Sidebar;
